src/cf/DataProcessors/ПомощникПереходаНаФСБУ14.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПереходаНаФСБУ14</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНМА</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеПриПереходе</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияПриПереходеНаФСБУ14</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНМА</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНематериальныхАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписания</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСписания1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСписания2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСписания3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеопределенныйСрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеопределенныйСрокПолезногоИспользованияДоПерехода</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисленияАмортизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисленияАмортизацииДоПерехода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияДоПерехода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРаботДоПерехода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДоПерехода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьДоПерехода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Амортизация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияДоПерехода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обесценение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбесценениеДоступноеДляВосстановления</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуществующееНМА</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменениеНераспределеннойПрибыли</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАмортизации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВыработки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/СпособыНачисленияАмортизацииНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНачисленияАмортизацииНМА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Линейный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшаемогоОстатка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОбъемуПродукции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ПомощникПереходаНаФСБУ14/Forms/ПараметрыАмортизации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменениеНесколькихСтрок = Параметры.ИзменениеНесколькихСтрок;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПараметрыАмортизации);
	// Тумблер реквизита типа Булево слева отображает значение Ложь, что соответствует значению "Неопределенный срок использования".
	// Чтобы слева отображалось значение, соответствующее "Срок использования можно определить", используем реквизит типа Булево
	// с инвертированным значением.
	СрокПолезногоИспользованияМожноОпределить = Не НеопределенныйСрокПолезногоИспользования;
	
	Если СрокПолезногоИспользованияМожноОпределить
		И Не ЗначениеЗаполнено(СпособНачисленияАмортизации)
		И Не ТолькоПросмотр
		И КлючНазначенияИспользования = "ЭлементыАмортизации" Тогда
		СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА.Линейный;
		Модифицированность = Истина;
	КонецЕсли;
	
	ПараметрыАмортизации = Параметры.ПараметрыАмортизации;
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ПеренестиВДокумент Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗакрытия = Новый Структура;
	РезультатЗакрытия.Вставить("ИзменениеНесколькихСтрок", ИзменениеНесколькихСтрок);
	РезультатЗакрытия.Вставить("ПараметрыАмортизации", ПараметрыАмортизации);
	ОповеститьОВыборе(РезультатЗакрытия);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособНачисленияАмортизацииПриИзменении(Элемент)
	УстановитьВидимостьЭлементовАмортизации(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СрокПолезногоИспользованияМожноОпределитьПриИзменении(Элемент)
	НеопределенныйСрокПолезногоИспользования = Не СрокПолезногоИспользованияМожноОпределить;
	УстановитьВидимостьЭлементовАмортизации(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Если Модифицированность Или ИзменениеНесколькихСтрок Тогда
		ПеренестиВДокумент = Истина;
		ЗаполнитьЗначенияСвойств(ПараметрыАмортизации, ЭтотОбъект);
	КонецЕсли;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФорму()
	
	Если КлючНазначенияИспользования = "ЭлементыАмортизации" Тогда
		Заголовок = НСтр("ru = 'Элементы амортизации'");
		УстановитьВидимостьЭлементовАмортизации(ЭтотОбъект);
		Элементы.ПараметрыНачисленияАмортизации.Видимость = Ложь;
	Иначе
		Заголовок = НСтр("ru = 'Счета амортизации'");
		Элементы.ЭлементыАмортизации.Видимость = Ложь;
		НастроитьВыборСчетовАмортизации();
	КонецЕсли;
	
	УстановитьВидимостьКоманд();

КонецПроцедуры

&НаСервере
Процедура НастроитьВыборСчетовАмортизации()

	СчетаДляВыбора = Новый ФиксированныйМассив(Обработки.ПомощникПереходаНаФСБУ14.СчетаУчетаНМА().СчетаАмортизации);

	НовыйМассивПараметров = Новый Массив;
	НовыйМассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", СчетаДляВыбора));

	Элементы.СчетУчетаАмортизации.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	
	Если Не ТолькоПросмотр И Не ЗначениеЗаполнено(СчетАмортизации) И СчетаДляВыбора.Количество() > 0 Тогда
		СчетАмортизации = СчетаДляВыбора[0];
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКоманд()

	Элементы.ФормаОК.Видимость = Не ТолькоПросмотр;
	Элементы.ФормаОтмена.Видимость = Не ТолькоПросмотр;
	Элементы.ФормаЗакрыть.Видимость = ТолькоПросмотр;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовАмортизации(Форма)

	Элементы = Форма.Элементы;
	Элементы.СпособНачисленияАмортизации.Видимость = Не Форма.НеопределенныйСрокПолезногоИспользования;
	Элементы.ГруппаЛиквидационнаяСтоимость.Видимость     = Не Форма.НеопределенныйСрокПолезногоИспользования;
	
	Если Форма.НеопределенныйСрокПолезногоИспользования Тогда
		
		Элементы.ГруппаСрокИспользования.Видимость  = Ложь;
		Элементы.Коэффициент.Видимость                 = Ложь;
		Элементы.ГруппаОбъемПродукции.Видимость         = Ложь;
			
	Иначе

		ЛинейныйСпособ = (Форма.СпособНачисленияАмортизации = ПредопределенноеЗначение(
		"Перечисление.СпособыНачисленияАмортизацииНМА.Линейный"));
		ПоОбъемуПродукции = (Форма.СпособНачисленияАмортизации = ПредопределенноеЗначение(
		"Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции"));
		УменьшаемыйОстаток = (Форма.СпособНачисленияАмортизации = ПредопределенноеЗначение(
		"Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка"));

		Элементы.ГруппаСрокИспользования.Видимость = ЛинейныйСпособ Или УменьшаемыйОстаток;
		Элементы.Коэффициент.Видимость = УменьшаемыйОстаток;
		Элементы.ГруппаОбъемПродукции.Видимость = ПоОбъемуПродукции;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
